{"class_name": "Functional", "config": {"name": "model_1", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 100, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "registered_name": null, "name": "input_4", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 100, 100, 3]}, "name": "block1_conv1", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block1_conv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 49, 49, 32]}, "name": "block1_conv1_bn", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block1_conv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 49, 49, 32]}, "name": "block1_conv1_act", "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block1_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 49, 49, 32]}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block1_conv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 47, 47, 64]}, "name": "block1_conv2_bn", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block1_conv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 47, 47, 64]}, "name": "block1_conv2_act", "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "block2_sepconv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 47, 47, 64]}, "name": "block2_sepconv1", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 47, 47, 128]}, "name": "block2_sepconv1_bn", "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block2_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 47, 47, 128]}, "name": "block2_sepconv2_act", "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "block2_sepconv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 47, 47, 128]}, "name": "block2_sepconv2", "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 47, 47, 128]}, "name": "block2_sepconv2_bn", "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 47, 47, 64]}, "name": "conv2d_12", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 47, 47, 128]}, "name": "block2_pool", "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 128]}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_36", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 24, 24, 128], [null, 24, 24, 128]]}, "name": "add_36", "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block3_sepconv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 128]}, "name": "block3_sepconv1_act", "inbound_nodes": [[["add_36", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "block3_sepconv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 128]}, "name": "block3_sepconv1", "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block3_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 256]}, "name": "block3_sepconv1_bn", "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block3_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 256]}, "name": "block3_sepconv2_act", "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "block3_sepconv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 256]}, "name": "block3_sepconv2", "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block3_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 256]}, "name": "block3_sepconv2_bn", "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 128]}, "name": "conv2d_13", "inbound_nodes": [[["add_36", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 256]}, "name": "block3_pool", "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 256]}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_37", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 12, 12, 256], [null, 12, 12, 256]]}, "name": "add_37", "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block4_sepconv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 256]}, "name": "block4_sepconv1_act", "inbound_nodes": [[["add_37", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "block4_sepconv1", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 256]}, "name": "block4_sepconv1", "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block4_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 728]}, "name": "block4_sepconv1_bn", "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block4_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 728]}, "name": "block4_sepconv2_act", "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "block4_sepconv2", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 728]}, "name": "block4_sepconv2", "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block4_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 728]}, "name": "block4_sepconv2_bn", "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 256]}, "name": "conv2d_14", "inbound_nodes": [[["add_37", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 728]}, "name": "block4_pool", "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_38", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 6, 6, 728], [null, 6, 6, 728]]}, "name": "add_38", "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_14", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block5_sepconv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block5_sepconv1_act", "inbound_nodes": [[["add_38", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "block5_sepconv1", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block5_sepconv1", "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block5_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block5_sepconv1_bn", "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block5_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block5_sepconv2_act", "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "block5_sepconv2", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block5_sepconv2", "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block5_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block5_sepconv2_bn", "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block5_sepconv3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block5_sepconv3_act", "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "block5_sepconv3", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block5_sepconv3", "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block5_sepconv3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block5_sepconv3_bn", "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_39", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 6, 6, 728], [null, 6, 6, 728]]}, "name": "add_39", "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_38", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block6_sepconv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block6_sepconv1_act", "inbound_nodes": [[["add_39", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "block6_sepconv1", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block6_sepconv1", "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block6_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block6_sepconv1_bn", "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block6_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block6_sepconv2_act", "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "block6_sepconv2", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block6_sepconv2", "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block6_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block6_sepconv2_bn", "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block6_sepconv3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block6_sepconv3_act", "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "block6_sepconv3", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block6_sepconv3", "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block6_sepconv3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block6_sepconv3_bn", "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_40", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 6, 6, 728], [null, 6, 6, 728]]}, "name": "add_40", "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_39", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block7_sepconv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block7_sepconv1_act", "inbound_nodes": [[["add_40", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "block7_sepconv1", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block7_sepconv1", "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block7_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block7_sepconv1_bn", "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block7_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block7_sepconv2_act", "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "block7_sepconv2", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "pointwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block7_sepconv2", "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block7_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block7_sepconv2_bn", "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block7_sepconv3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 728]}, "name": "block7_sepconv3_act", "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "SeparableConv2D", "config": {"name": "block7_sepconv3", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, 